# 6장 쿼리처럼 데이터 처리하기
## 6-1 데이터 연결
### 6-1-1 데이터 통합

## 예제 6-1

In [1]:
import pandas as pd
import numpy as np

In [2]:
df11 = pd.DataFrame(np.arange(16).reshape(4,4), 
                    index=['a','b','c','d'],
                    columns=['f','g','h','i'])

In [3]:
df11

    f   g   h   i
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [4]:
df12 = pd.DataFrame(np.arange(16,32).reshape(4,4), 
                    index=['a','b','c','d'],
                    columns=['f','g','h','i'])

In [5]:
df12

    f   g   h   i
a  16  17  18  19
b  20  21  22  23
c  24  25  26  27
d  28  29  30  31

In [6]:
pd.merge(df11,df12)

Empty DataFrame
Columns: [f, g, h, i]
Index: []

In [7]:
pd.merge(df11,df12,on='f')

Empty DataFrame
Columns: [f, g_x, h_x, i_x, g_y, h_y, i_y]
Index: []

In [8]:
df22 = pd.DataFrame(np.arange(16).reshape(4,4), 
                    index=['a','b','c','d'],
                    columns=['f','g','h','i'])

In [9]:
df22

    f   g   h   i
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [10]:
df_m1 = pd.merge(df11,df22, left_on="f", right_on="f", how='inner')

In [11]:
df_m1

    f  g_x  h_x  i_x  g_y  h_y  i_y
0   0    1    2    3    1    2    3
1   4    5    6    7    5    6    7
2   8    9   10   11    9   10   11
3  12   13   14   15   13   14   15

In [12]:
df_m2 = pd.merge(df11,df22, on="f", how='inner')

In [13]:
df_m2

    f  g_x  h_x  i_x  g_y  h_y  i_y
0   0    1    2    3    1    2    3
1   4    5    6    7    5    6    7
2   8    9   10   11    9   10   11
3  12   13   14   15   13   14   15

In [14]:
df_j = df11.join(df22,lsuffix="_L", rsuffix="_R")

In [15]:
df_j

   f_L  g_L  h_L  i_L  f_R  g_R  h_R  i_R
a    0    1    2    3    0    1    2    3
b    4    5    6    7    4    5    6    7
c    8    9   10   11    8    9   10   11
d   12   13   14   15   12   13   14   15

In [16]:
df_miss = pd.merge(df11,df12, on="f", how='outer')

In [17]:
df_miss

    f   g_x   h_x   i_x   g_y   h_y   i_y
0   0   1.0   2.0   3.0   NaN   NaN   NaN
1   4   5.0   6.0   7.0   NaN   NaN   NaN
2   8   9.0  10.0  11.0   NaN   NaN   NaN
3  12  13.0  14.0  15.0   NaN   NaN   NaN
4  16   NaN   NaN   NaN  17.0  18.0  19.0
5  20   NaN   NaN   NaN  21.0  22.0  23.0
6  24   NaN   NaN   NaN  25.0  26.0  27.0
7  28   NaN   NaN   NaN  29.0  30.0  31.0

In [18]:
pd.merge(df11,df12, on='f', how='outer', suffixes=['_L','_R'])

    f   g_L   h_L   i_L   g_R   h_R   i_R
0   0   1.0   2.0   3.0   NaN   NaN   NaN
1   4   5.0   6.0   7.0   NaN   NaN   NaN
2   8   9.0  10.0  11.0   NaN   NaN   NaN
3  12  13.0  14.0  15.0   NaN   NaN   NaN
4  16   NaN   NaN   NaN  17.0  18.0  19.0
5  20   NaN   NaN   NaN  21.0  22.0  23.0
6  24   NaN   NaN   NaN  25.0  26.0  27.0
7  28   NaN   NaN   NaN  29.0  30.0  31.0

In [19]:
df_emp = pd.DataFrame({'근로자' : ['철수','후순','영희','영재'],
                    '부서' : ['회계부','전산부','전산부','인사부']})

In [20]:
df_name = pd.DataFrame({'이름' : ['철수','후순','영희','영재'],
                    '고용년도' : [2004,2005,2006,2007]})

In [21]:
pd.merge(df_emp,df_name, left_on='근로자', right_on='이름')

  근로자   부서  이름  고용년도
0  철수  회계부  철수  2004
1  후순  전산부  후순  2005
2  영희  전산부  영희  2006
3  영재  인사부  영재  2007

In [22]:
pd.merge(df_emp,df_name, left_on='근로자', right_on='이름').drop('이름',axis=1)

  근로자   부서  고용년도
0  철수  회계부  2004
1  후순  전산부  2005
2  영희  전산부  2006
3  영재  인사부  2007

### 6-1-2 행의 인덱스를 통한 데이터 통합

## 예제 6-2 인덱스로 데이터 병합하기

In [23]:
df4 = pd.DataFrame({'근로자' : ['철수','후순','영희','영재'],
                    '부서' : ['회계부','전산부','전산부','인사부']})

In [24]:
df5 = pd.DataFrame({'근로자' : ['철수','후순','영희','영재'],
                    '고용년도' : [2004,2005,2006,2007]})

In [25]:
df4 = df4.set_index('근로자')

In [26]:
df5 = df5.set_index('근로자')

In [27]:
df_inx = pd.merge(df4,df5, left_index=True, right_index=True)

In [28]:
df_inx

      부서  고용년도
근로자
철수   회계부  2004
후순   전산부  2005
영희   전산부  2006
영재   인사부  2007

### 6-1-3 데이터 통합을 위한 조인 이해

## 예제 6-3 내부 값들에 대한 매핑 관계 확인하기

In [29]:
df11

    f   g   h   i
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [30]:
df22

    f   g   h   i
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [31]:
df_one = pd.merge(df11,df22, on='f', how='inner')

In [32]:
df_one

    f  g_x  h_x  i_x  g_y  h_y  i_y
0   0    1    2    3    1    2    3
1   4    5    6    7    5    6    7
2   8    9   10   11    9   10   11
3  12   13   14   15   13   14   15

In [33]:
df3 = pd.DataFrame({'고용자' : ['홍길동','김아무개','서용덕','조현웅'],
                    '부서' : ['재무부','공학부','공학부','인사부'],
                    '고용년도' : [2014,2015,2016,2017]})

In [34]:
df4 = pd.DataFrame({'부서' : ['재무부','공학부','인사부'],
                    '해당임원' : ['한규돈', '박찬주', '문달']})

In [35]:
df_one_many = pd.merge(df3,df4, on='부서')

In [36]:
df_one_many

    고용자   부서  고용년도 해당임원
0   홍길동  재무부  2014  한규돈
1  김아무개  공학부  2015  박찬주
2   서용덕  공학부  2016  박찬주
3   조현웅  인사부  2017   문달

In [37]:
df11

df22

df_one = pd.merge(df11,df22, on='f', how='inner')

df_one

df3 = pd.DataFrame({'고용자' : ['홍길동','김아무개','서용덕','조현웅'],
                    '부서' : ['재무부','공학부','공학부','인사부'],
                    '고용년도' : [2014,2015,2016,2017]})

df4 = pd.DataFrame({'부서' : ['재무부','공학부','인사부'],
                    '해당임원' : ['한규돈', '박찬주', '문달']})

df_one_many = pd.merge(df3,df4, on='부서')

df_one_many

    고용자   부서  고용년도 해당임원
0   홍길동  재무부  2014  한규돈
1  김아무개  공학부  2015  박찬주
2   서용덕  공학부  2016  박찬주
3   조현웅  인사부  2017   문달

### 6-1-4 데이터 통합 활용

## 예제 6-4 데이터 병합 활용하기

#### pd.read_excel() 명령어 옵션

In [42]:
korea_2012 = pd.read_excel('../data/korea_pop_2012.xls')     # encoding='cp949'

In [43]:
korea_2012.head()

  Unnamed: 0    2008    2009    2010    2011    2012
0          계  49,540  49,773  50,515  50,734  50,948
1         서울  10,201  10,208  10,312  10,250  10,195
2         부산   3,565   3,543   3,568   3,551   3,538
3         대구   2,493   2,489   2,512   2,508   2,506
4         인천   2,693   2,710   2,758   2,801   2,844

In [45]:
korea_2017 = pd.read_excel('../data/korea_pop_2017.xls')     # ,encoding='cp949'

In [46]:
korea_2017.head()

  Unnamed: 0    2013    2014    2015    2016    2017
0          계  51,141  51,328  51,529  51,696  51,778
1         서울  10,144  10,103  10,022   9,930   9,857
2         부산   3,528   3,519   3,513   3,498   3,470
3         대구   2,502   2,493   2,487   2,484   2,475
4         인천   2,880   2,903   2,925   2,943   2,948

In [47]:
korea_2017.index == korea_2012.index

array([ True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True])

In [48]:
korea_pop = pd.merge(korea_2012, korea_2017, left_index=True, right_index=True)

In [56]:
korea_pop.info()                              # get_dtype_counts()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0_x  18 non-null     object
 1   2008          18 non-null     object
 2   2009          18 non-null     object
 3   2010          18 non-null     object
 4   2011          18 non-null     object
 5   2012          18 non-null     object
 6   Unnamed: 0_y  18 non-null     object
 7   2013          18 non-null     object
 8   2014          18 non-null     object
 9   2015          18 non-null     object
 10  2016          18 non-null     object
 11  2017          18 non-null     object
dtypes: object(12)
memory usage: 1.8+ KB

In [57]:
korea_pop.shape

(18, 12)

In [58]:
for i in range(0,18) :
    a = korea_pop.iloc[i].str.replace(',','')
    korea_pop.iloc[i] = a

In [59]:
 korea_pop.head()

,Unnamed: 0_x,2008,2009,2010,2011,2012,Unnamed: 0_y,2013,2014,2015,2016,2017
0,계,49540,49773,50515,50734,50948,계,51141,51328,51529,51696,51778
1,서울,10201,10208,10312,10250,10195,서울,10144,10103,10022,9930,9857
2,부산,3565,3543,3568,3551,3538,부산,3528,3519,3513,3498,3470
3,대구,2493,2489,2512,2508,2506,대구,2502,2493,2487,2484,2475
4,인천,2693,2710,2758,2801,2844,인천,2880,2903,2925,2943,2948

In [60]:
korea_pop.get_dtype_counts()

AttributeError: 'DataFrame' object has no attribute 'get_dtype_counts'

In [61]:
korea_pop.isnull().sum()

Unnamed: 0_x    0
2008            0
2009            0
2010            0
2011            0
2012            0
Unnamed: 0_y    0
2013            0
2014            0
2015            0
2016            0
2017            0
dtype: int64

In [62]:
for i in range(0,18) :
    a = korea_pop.iloc[i].str.replace('-','NaN')
    korea_pop.iloc[i] = a

In [63]:
korea_pop = korea_pop.astype('float64')

ValueError: could not convert string to float: '계'

In [64]:
korea_pop.head(9)

,Unnamed: 0_x,2008,2009,2010,2011,2012,Unnamed: 0_y,2013,2014,2015,2016,2017
0,계,49540,49773,50515,50734,50948,계,51141,51328,51529,51696,51778
1,서울,10201,10208,10312,10250,10195,서울,10144,10103,10022,9930,9857
2,부산,3565,3543,3568,3551,3538,부산,3528,3519,3513,3498,3470
3,대구,2493,2489,2512,2508,2506,대구,2502,2493,2487,2484,2475
4,인천,2693,2710,2758,2801,2844,인천,2880,2903,2925,2943,2948
5,광주,1423,1433,1455,1463,1469,광주,1473,1476,1472,1469,1463
6,대전,1481,1484,1504,1516,1525,대전,1533,1532,1518,1514,1502
7,울산,1112,1114,1126,1136,1147,울산,1156,1166,1173,1172,1165
8,세종,NaN,NaN,NaN,NaN,113,세종,122,156,210,243,280

In [65]:
korea_pop.isnull().sum()

Unnamed: 0_x    0
2008            0
2009            0
2010            0
2011            0
2012            0
Unnamed: 0_y    0
2013            0
2014            0
2015            0
2016            0
2017            0
dtype: int64

In [66]:
korea_pop = korea_pop.fillna(0)

In [67]:
korea_pop.head(9)

,Unnamed: 0_x,2008,2009,2010,2011,2012,Unnamed: 0_y,2013,2014,2015,2016,2017
0,계,49540,49773,50515,50734,50948,계,51141,51328,51529,51696,51778
1,서울,10201,10208,10312,10250,10195,서울,10144,10103,10022,9930,9857
2,부산,3565,3543,3568,3551,3538,부산,3528,3519,3513,3498,3470
3,대구,2493,2489,2512,2508,2506,대구,2502,2493,2487,2484,2475
4,인천,2693,2710,2758,2801,2844,인천,2880,2903,2925,2943,2948
5,광주,1423,1433,1455,1463,1469,광주,1473,1476,1472,1469,1463
6,대전,1481,1484,1504,1516,1525,대전,1533,1532,1518,1514,1502
7,울산,1112,1114,1126,1136,1147,울산,1156,1166,1173,1172,1165
8,세종,NaN,NaN,NaN,NaN,113,세종,122,156,210,243,280

In [68]:
korea_pop = korea_pop.astype('int64')

ValueError: invalid literal for int() with base 10: '계'

In [69]:
korea_pop.head(9)

,Unnamed: 0_x,2008,2009,2010,2011,2012,Unnamed: 0_y,2013,2014,2015,2016,2017
0,계,49540,49773,50515,50734,50948,계,51141,51328,51529,51696,51778
1,서울,10201,10208,10312,10250,10195,서울,10144,10103,10022,9930,9857
2,부산,3565,3543,3568,3551,3538,부산,3528,3519,3513,3498,3470
3,대구,2493,2489,2512,2508,2506,대구,2502,2493,2487,2484,2475
4,인천,2693,2710,2758,2801,2844,인천,2880,2903,2925,2943,2948
5,광주,1423,1433,1455,1463,1469,광주,1473,1476,1472,1469,1463
6,대전,1481,1484,1504,1516,1525,대전,1533,1532,1518,1514,1502
7,울산,1112,1114,1126,1136,1147,울산,1156,1166,1173,1172,1165
8,세종,NaN,NaN,NaN,NaN,113,세종,122,156,210,243,280

In [70]:
korea_pop = korea_pop.drop(["계"],axis=0)

KeyError: "['계'] not found in axis"

In [71]:
korea_pop.head()

,Unnamed: 0_x,2008,2009,2010,2011,2012,Unnamed: 0_y,2013,2014,2015,2016,2017
0,계,49540,49773,50515,50734,50948,계,51141,51328,51529,51696,51778
1,서울,10201,10208,10312,10250,10195,서울,10144,10103,10022,9930,9857
2,부산,3565,3543,3568,3551,3538,부산,3528,3519,3513,3498,3470
3,대구,2493,2489,2512,2508,2506,대구,2502,2493,2487,2484,2475
4,인천,2693,2710,2758,2801,2844,인천,2880,2903,2925,2943,2948

### 6-1-5 SQL 문장의 조인 비교

## 예제 6-5 조인문 비교하기

In [72]:
import numpy as np

In [73]:
df1 = pd.DataFrame({'키': ['봄', '여름', '가을', '겨울'],
                    '값': np.random.randn(4)})

In [74]:
df2 = pd.DataFrame({'키': ['여름', '겨울', '겨울', '기타'],
                   '값': np.random.randn(4)})

SELECT *
FROM df1
INNER JOIN df2
  ON df1.key = df2.key;

In [75]:
 pd.merge(df1, df2, on='키')

    키       값_x       값_y
0  여름 -2.686796 -0.711811
1  겨울 -0.343960 -0.541809
2  겨울 -0.343960 -0.767199

In [76]:
 pd.merge(korea_2012, korea_2017, left_index=True, right_index=True).head()

,Unnamed: 0_x,2008,2009,2010,2011,2012,Unnamed: 0_y,2013,2014,2015,2016,2017
0,계,"49,540","49,773","50,515","50,734","50,948",계,"51,141","51,328","51,529","51,696","51,778"
1,서울,"10,201","10,208","10,312","10,250","10,195",서울,"10,144","10,103","10,022","9,930","9,857"
2,부산,"3,565","3,543","3,568","3,551","3,538",부산,"3,528","3,519","3,513","3,498","3,470"
3,대구,"2,493","2,489","2,512","2,508","2,506",대구,"2,502","2,493","2,487","2,484","2,475"
4,인천,"2,693","2,710","2,758","2,801","2,844",인천,"2,880","2,903","2,925","2,943","2,948"

SELECT *
FROM df1
LEFT OUTER JOIN df2
  ON df1.key = df2.key;

In [77]:
pd.merge(df1, df2, on='키', how='left')

    키       값_x       값_y
0   봄 -0.941895       NaN
1  여름 -2.686796 -0.711811
2  가을  1.414731       NaN
3  겨울 -0.343960 -0.541809
4  겨울 -0.343960 -0.767199

SELECT *
FROM df1
RIGHT OUTER JOIN df2
  ON df1.key = df2.key;

In [78]:
pd.merge(df1, df2, on='키', how='right')

    키       값_x       값_y
0  여름 -2.686796 -0.711811
1  겨울 -0.343960 -0.541809
2  겨울 -0.343960 -0.767199
3  기타       NaN -0.498695

SELECT *
FROM df1
FULL OUTER JOIN df2
  ON df1.key = df2.key;

In [79]:
pd.merge(df1, df2, on='키', how='outer')

    키       값_x       값_y
0   봄 -0.941895       NaN
1  여름 -2.686796 -0.711811
2  가을  1.414731       NaN
3  겨울 -0.343960 -0.541809
4  겨울 -0.343960 -0.767199
5  기타       NaN -0.498695

SELECT city, rank
FROM df1
UNION ALL
SELECT city, rank
FROM df2;

In [80]:
pd.concat([df1, df2])

    키         값
0   봄 -0.941895
1  여름 -2.686796
2  가을  1.414731
3  겨울 -0.343960
0  여름 -0.711811
1  겨울 -0.541809
2  겨울 -0.767199
3  기타 -0.498695

SELECT city, rank
FROM df1
UNION
SELECT city, rank
FROM df2;

In [81]:
df2.loc[1] = df1.loc[3]

In [82]:
pd.concat([df1, df2]).drop_duplicates()

    키         값
0   봄 -0.941895
1  여름 -2.686796
2  가을  1.414731
3  겨울 -0.343960
0  여름 -0.711811
2  겨울 -0.767199
3  기타 -0.498695

## 6-2 조건절 처리하기
### 6-2-1 특정 조건식으로 선택 처리

## 예제 6-6 조건식을 이용해 처리하기

In [83]:
korea_2018 = pd.read_excel('../data/factory_reg_2018.xlsx',
                           sheet_name=2,
                           header=[2,3],
                           encoding='cp949')

TypeError: read_excel() got an unexpected keyword argument 'encoding'

In [84]:
korea_2018.head()

NameError: name 'korea_2018' is not defined

In [85]:
korea_2018.tail()

NameError: name 'korea_2018' is not defined

In [86]:
korea_2018.info()

NameError: name 'korea_2018' is not defined

In [87]:
korea_2018.shape

NameError: name 'korea_2018' is not defined

In [88]:
korea_2018 = korea_2018.dropna()

NameError: name 'korea_2018' is not defined

In [89]:
korea_2018.shape

NameError: name 'korea_2018' is not defined

In [90]:
korea_2018.tail()

NameError: name 'korea_2018' is not defined

In [91]:
korea_2018.get_dtype_counts()

NameError: name 'korea_2018' is not defined

In [92]:
korea_2018 = korea_2018.astype('int64')

NameError: name 'korea_2018' is not defined

In [93]:
korea_2018.get_dtype_counts()

NameError: name 'korea_2018' is not defined

In [94]:
korea_2018.columns.levels[0]

NameError: name 'korea_2018' is not defined

In [95]:
korea_2018.columns.levels[1]

NameError: name 'korea_2018' is not defined

In [96]:
korea_2018.columns = ['서울','부산','대구','인천','광주','대전','울산','세종',
                      '경기','강원','충북','충남','전북','전남','경북','경남','제주','합계']

NameError: name 'korea_2018' is not defined

In [97]:
korea_2018.head()

NameError: name 'korea_2018' is not defined

In [98]:
korea_2018[['서울', '제주']].head()

NameError: name 'korea_2018' is not defined

In [99]:
korea_2018.columns.isin(['서울','제주'])

NameError: name 'korea_2018' is not defined

In [100]:
korea_2018_서울_제주 = korea_2018.iloc[:,korea_2018.columns.isin(['서울','제주'])]

NameError: name 'korea_2018' is not defined

In [101]:
korea_2018_서울_제주.head()

NameError: name 'korea_2018_서울_제주' is not defined

In [102]:
korea_2018_서울_제주.서울.between(10, 20).sum()

NameError: name 'korea_2018_서울_제주' is not defined

In [103]:
korea_2018_서울_제주.loc[korea_2018_서울_제주.서울.between(10, 20),'서울']

NameError: name 'korea_2018_서울_제주' is not defined

In [104]:
korea_2018.query('서울 >=10 & 서울 <= 20')

NameError: name 'korea_2018' is not defined

In [105]:
korea_2018.query('서울 >=10 & 서울 <= 20')['서울']

NameError: name 'korea_2018' is not defined

In [106]:
korea_2018.query('서울 >=10 & 서울 <= 20')[['서울']]

NameError: name 'korea_2018' is not defined

In [107]:
mm = 10

In [108]:
nn = 20

In [109]:
qs1 = "@mm <= 서울 <= @nn "

In [110]:
korea_2018.query(qs1)[['서울']]

NameError: name 'korea_2018' is not defined

In [111]:
korea_2018 = pd.read_excel('../data/factory_reg_2018.xlsx',
                           sheet_name=2,
                           header=[2,3],
                           encoding='cp949')

korea_2018.head()

korea_2018.tail()

korea_2018.info()

korea_2018.shape

korea_2018 = korea_2018.dropna()

korea_2018.shape

korea_2018.tail()

korea_2018.get_dtype_counts()

korea_2018 = korea_2018.astype('int64')

korea_2018.get_dtype_counts()

korea_2018.columns.levels[0]

korea_2018.columns.levels[1]

korea_2018.columns = ['서울','부산','대구','인천','광주','대전','울산','세종',
                      '경기','강원','충북','충남','전북','전남','경북','경남','제주','합계']

korea_2018.head()

korea_2018[['서울', '제주']].head()

korea_2018.columns.isin(['서울','제주'])

korea_2018_서울_제주 = korea_2018.iloc[:,korea_2018.columns.isin(['서울','제주'])]

korea_2018_서울_제주.head()

korea_2018_서울_제주.서울.between(10, 20).sum()

korea_2018_서울_제주.loc[korea_2018_서울_제주.서울.between(10, 20),'서울']

korea_2018.query('서울 >=10 & 서울 <= 20')

korea_2018.query('서울 >=10 & 서울 <= 20')['서울']

korea_2018.query('서울 >=10 & 서울 <= 20')[['서울']]

mm = 10

nn = 20

qs1 = "@mm <= 서울 <= @nn "

korea_2018.query(qs1)[['서울']]

TypeError: read_excel() got an unexpected keyword argument 'encoding'

### 6-2-2 추가적인 조건절 처리 메소드

## 예제 6-7 추가적인 조건절 처리 메소드 알아보기

In [112]:
korea_2018.where(korea_2018['서울'] < 30).head()

NameError: name 'korea_2018' is not defined

In [113]:
korea_2018.where(korea_2018['서울'] < 30, 0.0).head()

NameError: name 'korea_2018' is not defined

In [114]:
korea_2018.mask(korea_2018['서울'] < 30).head()

NameError: name 'korea_2018' is not defined

In [115]:
korea_2018.mask(korea_2018['서울'] < 30, 0.0).head()

NameError: name 'korea_2018' is not defined

In [116]:
korea_2018.take([0],axis=0)

NameError: name 'korea_2018' is not defined

In [117]:
korea_2018.take([0],axis=1).head()

NameError: name 'korea_2018' is not defined

In [118]:
korea_2018.take([0,3,5],axis=1).head()

NameError: name 'korea_2018' is not defined

### 6-2-3 SQL 문장과 판다스 처리 비교

## 6-8 SQL 문장과 비교하기

SELECT 서울, 인천, 대전 
FROM korea_2018
LIMIT 5;

In [119]:
korea_2018[['서울', '인천', '대전']].head(5)

NameError: name 'korea_2018' is not defined

SELECT *
FROM korea_2018
WHERE 서울 = 41
LIMIT 5;

In [120]:
korea_2018[korea_2018['서울'] == 41 ].head(5)

NameError: name 'korea_2018' is not defined

In [121]:
is_41 = korea_2018['서울'] == 41

NameError: name 'korea_2018' is not defined

In [122]:
is_41.value_counts()

NameError: name 'is_41' is not defined

In [123]:
korea_2018[is_41].head(5)

NameError: name 'korea_2018' is not defined

SELECT *
FROM korea_2018
WHERE 서울 < 41 & 제주 > 5
LIMIT 5;

In [124]:
korea_2018[(korea_2018['서울'] < 41) &  (korea_2018['제주'] > 0)]

NameError: name 'korea_2018' is not defined

In [125]:
book_data = pd.read_csv("../data/book_data.csv",encoding='cp949')

In [126]:
book_data.head()

,book_name,book_writer,book_date,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher,sales_point
0,올 더 빌딩스 인 런던,제임스 걸리버 핸콕,2018-08-25,"14,400",양장본,140,225*280mm,476,예술/대중문화,책발전소,110
1,렛 잇 블리드,이언 랜킨,2018-08-19,"13,320",반양장본,476,128*188mm,476,소설/시/희곡,오픈하우스,110
2,은유로 사회 읽기,대니얼 리그니,2018-08-20,"39,500",양장본,416,152*223mm,749,사회과학,한울(한울아카데미),10
3,유럽 맥주 여행,백경학,2018-08-24,"14,400",반양장본,308,150*220mm,400,역사,글항아리,10
4,"이게, 행복이 아니면 무엇이지",김혜령,2018-08-20,"13,050",NaN,288,135*200mm,374,인문학,웨일북,10

In [127]:
book_filter = book_data.filter(like="book")

In [128]:
book_filter.head()

,book_name,book_writer,book_date,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher
0,올 더 빌딩스 인 런던,제임스 걸리버 핸콕,2018-08-25,"14,400",양장본,140,225*280mm,476,예술/대중문화,책발전소
1,렛 잇 블리드,이언 랜킨,2018-08-19,"13,320",반양장본,476,128*188mm,476,소설/시/희곡,오픈하우스
2,은유로 사회 읽기,대니얼 리그니,2018-08-20,"39,500",양장본,416,152*223mm,749,사회과학,한울(한울아카데미)
3,유럽 맥주 여행,백경학,2018-08-24,"14,400",반양장본,308,150*220mm,400,역사,글항아리
4,"이게, 행복이 아니면 무엇이지",김혜령,2018-08-20,"13,050",NaN,288,135*200mm,374,인문학,웨일북

## 6-3 내부의 값을 그룹화 처리
### 6-3-1 하나의 열을 그룹화 처리

## 예제 6-9 데이터 그룹화하기

In [255]:
book_data = pd.read_csv("../data/book_data.csv",encoding='cp949')

In [256]:
book_data.shape

(2000, 11)

In [257]:
book_data.head(10)                       # get_dtype_counts()

,book_name,book_writer,book_date,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher,sales_point
0,올 더 빌딩스 인 런던,제임스 걸리버 핸콕,2018-08-25,"14,400",양장본,140,225*280mm,476,예술/대중문화,책발전소,110
1,렛 잇 블리드,이언 랜킨,2018-08-19,"13,320",반양장본,476,128*188mm,476,소설/시/희곡,오픈하우스,110
2,은유로 사회 읽기,대니얼 리그니,2018-08-20,"39,500",양장본,416,152*223mm,749,사회과학,한울(한울아카데미),10
3,유럽 맥주 여행,백경학,2018-08-24,"14,400",반양장본,308,150*220mm,400,역사,글항아리,10
4,"이게, 행복이 아니면 무엇이지",김혜령,2018-08-20,"13,050",NaN,288,135*200mm,374,인문학,웨일북,10
5,이명현의 과학책방,이명현,2018-09-10,"15,300",NaN,400,146*210mm,520,과학,사월의책,210
6,전환의 시대,박노자,2018-08-27,"13,500",반양장본,308,145*217mm,400,사회과학,한겨레출판,10
7,내 주위에는 왜 욱하는 사람들이 많은 걸까?,오카다 다카시,2018-08-24,"13,500",NaN,308,148*215mm,400,인문학,세종서적,10
8,죽음에 관하여 스페셜 에디션 3 (양장),시니,2018-09-05,"13,500",양장본,248,150*220mm,347,만화,영컴(YOUNG COM),310
9,인듀어런스,스콧 켈리,2018-08-31,"19,800",NaN,508,152*225mm,965,과학,클,10

In [258]:
book_data.columns

Index(['book_name', 'book_writer', 'book_date', 'book_price', 'book_cover',
       'book_page', 'book_size', 'book_weight', 'book_category',
       'book_publisher', 'sales_point'],
      dtype='object')

In [259]:
book_data.count()

book_name         2000
book_writer       2000
book_date         2000
book_price        2000
book_cover        1683
book_page         2000
book_size         1999
book_weight       2000
book_category     2000
book_publisher    2000
sales_point       2000
dtype: int64

In [260]:
book_data.head()

,book_name,book_writer,book_date,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher,sales_point
0,올 더 빌딩스 인 런던,제임스 걸리버 핸콕,2018-08-25,"14,400",양장본,140,225*280mm,476,예술/대중문화,책발전소,110
1,렛 잇 블리드,이언 랜킨,2018-08-19,"13,320",반양장본,476,128*188mm,476,소설/시/희곡,오픈하우스,110
2,은유로 사회 읽기,대니얼 리그니,2018-08-20,"39,500",양장본,416,152*223mm,749,사회과학,한울(한울아카데미),10
3,유럽 맥주 여행,백경학,2018-08-24,"14,400",반양장본,308,150*220mm,400,역사,글항아리,10
4,"이게, 행복이 아니면 무엇이지",김혜령,2018-08-20,"13,050",NaN,288,135*200mm,374,인문학,웨일북,10

In [261]:
book_data.book_date.max()

'초판출간 2008년'

In [262]:
book_data.book_date.replace('초판출간 2008년', '2018-01-01',inplace=True)

In [263]:
book_data.book_date.max()

'2018-09-28'

In [264]:
book_data.book_cover.value_counts()

반양장본    1236
양장본      447
Name: book_cover, dtype: int64

In [265]:
book_data.book_cover.fillna("반양장본",inplace=True)

In [266]:
book_data.book_size.value_counts().head()

128*188mm    146
148*210mm    129
152*223mm    106
152*225mm    105
140*210mm     68
Name: book_size, dtype: int64

In [267]:
book_data.book_size.fillna('128*188mm',inplace=True)

In [268]:
book_data.count()

book_name         2000
book_writer       2000
book_date         2000
book_price        2000
book_cover        2000
book_page         2000
book_size         2000
book_weight       2000
book_category     2000
book_publisher    2000
sales_point       2000
dtype: int64

In [269]:
book_data.book_publisher.head()

0          책발전소
1         오픈하우스
2    한울(한울아카데미)
3          글항아리
4           웨일북
Name: book_publisher, dtype: object

In [270]:
book_data.book_publisher.value_counts().head()

위즈덤하우스          41
민음사             33
문학동네            28
창비              19
알에이치코리아(RHK)    17
Name: book_publisher, dtype: int64

In [271]:
book_data.book_price.value_counts().head()

13,500    221
10,800    188
11,700    170
14,400    149
12,600    122
Name: book_price, dtype: int64

In [272]:
book_data.book_price.value_counts().shape

(171,)

In [273]:
book_data_gr = book_data.groupby('book_price')

In [274]:
type(book_data_gr)

pandas.core.groupby.generic.DataFrameGroupBy

In [275]:
book_data_gr.ngroups

171

In [276]:
type(book_data_gr.groups)

pandas.io.formats.printing.PrettyDict

In [277]:
book_data_gr.groups.keys()

dict_keys(['10,080', '10,260', '10,350', '10,450', '10,620', '10,710', '10,800', '11,160', '11,250', '11,400', '11,520', '11,700', '11,760', '112,100', '12,000', '12,150', '12,330', '12,350', '12,420', '12,510', '12,600', '12,750', '12,780', '12,870', '13,000', '13,050', '13,110', '13,300', '13,320', '13,410', '13,440', '13,500', '13,950', '14,000', '14,220', '14,250', '14,400', '14,850', '15,000', '15,120', '15,210', '15,300', '15,750', '16,000', '16,020', '16,110', '16,200', '16,500', '16,650', '16,920', '17,010', '17,100', '17,550', '17,820', '18,000', '18,530', '18,900', '19,000', '19,200', '19,620', '19,800', '20,000', '20,250', '20,700', '21,420', '21,600', '21,960', '22,000', '22,050', '22,500', '22,900', '220,000', '23,100', '23,400', '23,750', '24,000', '24,300', '24,500', '25,000', '25,200', '25,650', '25,900', '26,100', '26,600', '26,820', '27,000', '27,270', '27,550', '27,900', '28,000', '28,500', '28,800', '288,000', '29,000', '29,500', '29,520', '29,700', '297,000', '3,000', '3,510', '30,400', '30,600', '31,500', '32,220', '32,400', '33,000', '33,300', '34,200', '35,100', '36,000', '36,450', '38,700', '39,420', '39,500', '4,000', '4,410', '4,500', '4,900', '4,950', '40,000', '40,500', '40,850', '42,750', '43,200', '44,100', '45,000', '45,600', '45,900', '47,700', '48,600', '49,500', '5,250', '5,310', '5,400', '5,850', '5,950', '50,350', '52,200', '53,100', '54,000', '58,000', '6,120', '6,300', '6,720', '6,750', '63,900', '64,800', '7,000', '7,020', '7,200', '7,650', '7,920', '72,000', '75,600', '78,300', '8,010', '8,100', '8,400', '8,550', '8,820', '8,910', '81,000', '88,200', '9,000', '9,100', '9,450', '9,500', '9,520', '9,720', '9,810', '9,900'])

In [278]:
book_data_gr.groups['10,080']

Int64Index([27, 49, 76, 541, 651, 802, 1339], dtype='int64')

In [279]:
book_data_gr.groups['10,080'].size

7

In [280]:
book_data_gr.get_group('10,080').head()

,book_name,book_writer,book_date,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher,sales_point
27,알록달록,정여울,2018-08-16,"10,080",반양장본,168,128*188mm,168,에세이,천년의상상,480
49,생각이 만든 감옥,맨리 P. 홀,2018-08-20,"10,080",반양장본,208,128*188mm,208,인문학,마름돌,"1,350"
76,1984,조지 오웰,2018-08-20,"10,080",반양장본,428,135*210mm,556,소설/시/희곡,더디,160
541,첫 문장,윤성희,2018-07-25,"10,080",양장본,152,104*182mm,234,소설/시/희곡,현대문학,"1,850"
651,"야옹아, 내가 집사라도 괜찮을까?",마담툰,2018-07-19,"10,080",반양장본,176,140*200mm,232,만화,네오카툰,630

In [281]:
book_data.sales_point.dtype

dtype('O')

In [282]:
book_data.book_weight.dtype

dtype('int64')

In [283]:
book_weight = book_data.book_weight

In [284]:
for i in range(0,2000) :
    a = book_data.iloc[i].str.replace(',','')
    book_data.iloc[i] = a

In [285]:
book_data.sales_point = book_data.sales_point.astype('float64')

In [286]:
book_data.book_weight.dtype

dtype('float64')

In [287]:
book_data.head()

,book_name,book_writer,book_date,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher,sales_point
0,올 더 빌딩스 인 런던,제임스 걸리버 핸콕,2018-08-25,14400,양장본,140,225*280mm,NaN,예술/대중문화,책발전소,110.0
1,렛 잇 블리드,이언 랜킨,2018-08-19,13320,반양장본,476,128*188mm,NaN,소설/시/희곡,오픈하우스,110.0
2,은유로 사회 읽기,대니얼 리그니,2018-08-20,39500,양장본,416,152*223mm,NaN,사회과학,한울(한울아카데미),10.0
3,유럽 맥주 여행,백경학,2018-08-24,14400,반양장본,308,150*220mm,NaN,역사,글항아리,10.0
4,이게 행복이 아니면 무엇이지,김혜령,2018-08-20,13050,반양장본,288,135*200mm,NaN,인문학,웨일북,10.0

In [288]:
book_data.book_weight = book_weight

In [289]:
book_data.head()

,book_name,book_writer,book_date,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher,sales_point
0,올 더 빌딩스 인 런던,제임스 걸리버 핸콕,2018-08-25,14400,양장본,140,225*280mm,476,예술/대중문화,책발전소,110.0
1,렛 잇 블리드,이언 랜킨,2018-08-19,13320,반양장본,476,128*188mm,476,소설/시/희곡,오픈하우스,110.0
2,은유로 사회 읽기,대니얼 리그니,2018-08-20,39500,양장본,416,152*223mm,749,사회과학,한울(한울아카데미),10.0
3,유럽 맥주 여행,백경학,2018-08-24,14400,반양장본,308,150*220mm,400,역사,글항아리,10.0
4,이게 행복이 아니면 무엇이지,김혜령,2018-08-20,13050,반양장본,288,135*200mm,374,인문학,웨일북,10.0

In [290]:
book_data.groupby('book_cover').agg({'book_name':'count',
                                     'sales_point':'mean', 
                                     'book_weight':'mean'})

            book_name  sales_point  book_weight
book_cover
반양장본             1553  3522.652930   494.649066
양장본               447  4171.825503   582.709172

In [291]:
book_new = book_data.groupby('book_date').agg({'book_name':'count',
                                     'sales_point':'mean', 
                                     'book_weight':'mean'})

In [292]:
book_new = book_new.sort_index()

In [293]:
book_new.head()

            book_name  sales_point  book_weight
book_date
2018-01-01          1        310.0        513.0
2018-03-20          1      42477.0        416.0
2018-03-23          1         80.0        408.0
2018-04-01          1        140.0        406.0
2018-04-10          1        150.0       1719.0

In [294]:
book_new.columns = ['book_count','sales_point', 'book_weight']

In [295]:
book_new.head()

            book_count  sales_point  book_weight
book_date
2018-01-01           1        310.0        513.0
2018-03-20           1      42477.0        416.0
2018-03-23           1         80.0        408.0
2018-04-01           1        140.0        406.0
2018-04-10           1        150.0       1719.0

In [296]:
book_new.nlargest(5,columns='book_count')

            book_count  sales_point  book_weight
book_date
2018-07-20         101  2936.079208   531.326733
2018-06-20          90  6455.222222   488.522222
2018-06-15          89  3370.337079   541.022472
2018-06-25          89  8031.067416   552.314607
2018-07-25          70  2968.285714   476.857143

In [297]:
book_new.nsmallest(5,columns='book_count')

            book_count  sales_point  book_weight
book_date
2018-01-01           1        310.0        513.0
2018-03-20           1      42477.0        416.0
2018-03-23           1         80.0        408.0
2018-04-01           1        140.0        406.0
2018-04-10           1        150.0       1719.0

### 6-3-2 여러 개의 열을 그룹화 처리

## 예제 6-10 여러 개 열을 그룹화하기

In [298]:
group_cols = ['book_date','book_cover']

In [299]:
agg_cols=['sales_point','book_weight']

In [300]:
fg = book_data.groupby(group_cols)[agg_cols].agg(['sum','mean','size'])

In [301]:
fg.head()

                      sales_point               book_weight
                              sum     mean size         sum    mean size
book_date  book_cover
2018-01-01 반양장본             310.0    310.0    1         513   513.0    1
2018-03-20 반양장본           42477.0  42477.0    1         416   416.0    1
2018-03-23 양장본               80.0     80.0    1         408   408.0    1
2018-04-01 반양장본             140.0    140.0    1         406   406.0    1
2018-04-10 양장본              150.0    150.0    1        1719  1719.0    1

In [302]:
level1 = fg.columns.get_level_values(0)

In [303]:
level2 = fg.columns.get_level_values(1)

In [304]:
fg.columns = level1 + '_' + level2

In [305]:
fg.head()

,,sales_point_sum,sales_point_mean,sales_point_size,book_weight_sum,book_weight_mean,book_weight_size
book_date,book_cover,,,,,,
2018-01-01,반양장본,310.0,310.0,1,513,513.0,1
2018-03-20,반양장본,42477.0,42477.0,1,416,416.0,1
2018-03-23,양장본,80.0,80.0,1,408,408.0,1
2018-04-01,반양장본,140.0,140.0,1,406,406.0,1
2018-04-10,양장본,150.0,150.0,1,1719,1719.0,1

In [306]:
fg_ = book_data.groupby(group_cols)[agg_cols].transform('sum')

In [307]:
fg_.head()

   sales_point  book_weight
0        470.0          865
1        110.0          476
2       4430.0         2627
3      47490.0         5973
4      82390.0        17282

In [308]:
book_data.groupby(group_cols).apply(lambda x: x['sales_point']* 100).head()

book_date   book_cover
2018-01-01  반양장본        1960      31000.0
2018-03-20  반양장본        1014    4247700.0
2018-03-23  양장본         563        8000.0
2018-04-01  반양장본        882       14000.0
2018-04-10  양장본         1145      15000.0
Name: sales_point, dtype: float64

In [309]:
book_data.groupby(group_cols)['sales_point'].transform(lambda x: x * 100).head()

0    11000.0
1    11000.0
2     1000.0
3     1000.0
4     1000.0
Name: sales_point, dtype: float64

In [310]:
book_data.groupby(group_cols)[['sales_point']].transform(lambda x: x * 100).head()

   sales_point
0      11000.0
1      11000.0
2       1000.0
3       1000.0
4       1000.0

In [311]:
book_data.groupby(group_cols)['sales_point', 'book_weight'].transform(lambda x: x * 100).head()

<ipython-input-311-7ba104be0240>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  book_data.groupby(group_cols)['sales_point', 'book_weight'].transform(lambda x: x * 100).head()

   sales_point  book_weight
0      11000.0        47600
1      11000.0        47600
2       1000.0        74900
3       1000.0        40000
4       1000.0        37400

### 6-3-3 SQL 문의 그룹 처리와 판다스의 그룹 처리 비교

## 예제 6-11 SQL과 비교하여 그룹화 처리하기

SELECT book_date, count(*)
FROM book_data
GROUP BY book_date;

In [312]:
book_data.groupby('book_date').size().head()

book_date
2018-01-01    1
2018-03-20    1
2018-03-23    1
2018-04-01    1
2018-04-10    1
dtype: int64

In [313]:
book_data.groupby('book_date').count().head()

,book_name,book_writer,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher,sales_point
book_date,,,,,,,,,,
2018-01-01,1,1,1,1,1,1,1,1,1,1
2018-03-20,1,1,1,1,1,1,1,1,1,1
2018-03-23,1,1,1,1,1,1,1,1,1,1
2018-04-01,1,1,1,1,1,1,1,1,1,1
2018-04-10,1,1,1,1,1,1,1,1,1,1

In [314]:
book_data.groupby('book_date')['sales_point'].count().head()

book_date
2018-01-01    1
2018-03-20    1
2018-03-23    1
2018-04-01    1
2018-04-10    1
Name: sales_point, dtype: int64

SELECT book_date, AVG('sales_point'), COUNT(*)
FROM book_data
GROUP BY book_date;

In [315]:
import numpy as np

In [316]:
book_data.groupby('book_date').agg({'sales_point': np.mean, 
                                    'book_date': np.size}).head()

            sales_point  book_date
book_date
2018-01-01        310.0          1
2018-03-20      42477.0          1
2018-03-23         80.0          1
2018-04-01        140.0          1
2018-04-10        150.0          1

SELECT book_date,book_cover, COUNT(*), AVG(sales_point)
FROM book_data
GROUP BY book_date,book_cover;

In [317]:
book_data.groupby(['book_date','book_cover']).agg({'sales_point': [np.size, np.mean]}).head()

                      sales_point
                             size     mean
book_date  book_cover
2018-01-01 반양장본               1.0    310.0
2018-03-20 반양장본               1.0  42477.0
2018-03-23 양장본                1.0     80.0
2018-04-01 반양장본               1.0    140.0
2018-04-10 양장본                1.0    150.0

### 6-3-4 원천 데이터를 그룹화하여 새로운 데이터 만들기

## 예제 6-12 그룹화 처리 후 파일 저장하기

In [318]:
asia = pd.read_csv('../data/dataset_raw_data.csv',encoding="cp949")

In [319]:
asia.shape

(95012, 12)

In [320]:
asia.columns

Index(['노선명', '항공사', '출발 공항', '출발 국가', '도착 공항', '도착 국가', '기체번호', '기종',
       '정원(전체)', '년도', '월', '일'],
      dtype='object')

In [321]:
asia.head()

,노선명,항공사,출발 공항,출발 국가,도착 공항,도착 국가,기체번호,기종,정원(전체),년도,월,일
0,7J105,Tajik Air,DYU,TJK,IKA,IRI,EY-444,B737-3L9,149,2018,1,7
1,7J105,Tajik Air,DYU,TJK,IKA,IRI,EY-444,B737-3L9,149,2018,1,14
2,7J105,Tajik Air,DYU,TJK,IKA,IRI,EY-444,B737-3L9,149,2018,1,21
3,7J105,Tajik Air,DYU,TJK,IKA,IRI,EY-444,B737-3L9,149,2018,1,29
4,7J105,Tajik Air,DYU,TJK,IKA,IRI,EY-444,B737-3L9,149,2018,2,4

In [322]:
asia.tail()

,노선명,항공사,출발 공항,출발 국가,도착 공항,도착 국가,기체번호,기종,정원(전체),년도,월,일
95007,ZM809,Air Manas,FRU,KGZ,KHG,CHN,EX-37801,B737-82R,189,2016,12,16
95008,ZM809,Air Manas,FRU,KGZ,KHG,CHN,EX-37801,B737-82R,189,2016,12,19
95009,ZM809,Air Manas,FRU,KGZ,KHG,CHN,EX-37801,B737-82R,189,2016,12,23
95010,ZM809,Air Manas,FRU,KGZ,KHG,CHN,EX-37801,B737-82R,189,2016,12,26
95011,ZM809,Air Manas,FRU,KGZ,KHG,CHN,EX-37801,B737-82R,189,2016,12,30

In [323]:
asia.count()

노선명       95012
항공사       95012
출발 공항     95012
출발 국가     95012
도착 공항     95012
도착 국가     95012
기체번호      95012
기종        95012
정원(전체)    95012
년도        95012
월         95012
일         95012
dtype: int64

In [334]:
asia.groupby('항공사').count()                                # get_dtype_counts()

,노선명,출발 공항,출발 국가,도착 공항,도착 국가,기체번호,기종,정원(전체),년도,월,일
항공사,,,,,,,,,,,
AZAL Azerbaijan Airlines,86,86,86,86,86,86,86,86,86,86,86
Aeroflot,8482,8482,8482,8482,8482,8482,8482,8482,8482,8482,8482
Air Arabia,591,591,591,591,591,591,591,591,591,591,591
Air Astana,20450,20450,20450,20450,20450,20450,20450,20450,20450,20450,20450
Air Baltic,14,14,14,14,14,14,14,14,14,14,14
Air China,137,137,137,137,137,137,137,137,137,137,137
Air Kyrgyzstan,299,299,299,299,299,299,299,299,299,299,299
Air Manas,1456,1456,1456,1456,1456,1456,1456,1456,1456,1456,1456
Airzena Georgian Airways,11,11,11,11,11,11,11,11,11,11,11
Asiana Airlines,681,681,681,681,681,681,681,681,681,681,681
AtlasGlobal,902,902,902,902,902,902,902,902,902,902,902
Avia Traffic Company,2504,2504,2504,2504,2504,2504,2504,2504,2504,2504,2504
Bek Air,2,2,2,2,2,2,2,2,2,2,2
Belavia,1283,1283,1283,1283,1283,1283,1283,1283,1283,1283,1283
China Southern Airlines,2244,2244,2244,2244,2244,2244,2244,2244,2244,2244,2244
Ellinair,43,43,43,43,43,43,43,43,43,43,43
Etihad Airways,273,273,273,273,273,273,273,273,273,273,273
Finnair,18,18,18,18,18,18,18,18,18,18,18
Globus,11,11,11,11,11,11,11,11,11,11,11
Hainan Airlines,206,206,206,206,206,206,206,206,206,206,206
Iran Aseman Airlines,18,18,18,18,18,18,18,18,18,18,18
KLM Royal Dutch Airlines,297,297,297,297,297,297,297,297,297,297,297
Kam Air,144,144,144,144,144,144,144,144,144,144,144
Korean Air,312,312,312,312,312,312,312,312,312,312,312
LOT - Polish Airlines,179,179,179,179,179,179,179,179,179,179,179
Lufthansa,1245,1245,1245,1245,1245,1245,1245,1245,1245,1245,1245
MIAT,1,1,1,1,1,1,1,1,1,1,1
Mahan Air,8,8,8,8,8,8,8,8,8,8,8
NordStar,26,26,26,26,26,26,26,26,26,26,26
Pegas Fly,24,24,24,24,24,24,24,24,24,24,24
Pegasus Airlines,1241,1241,1241,1241,1241,1241,1241,1241,1241,1241,1241
Pobeda,233,233,233,233,233,233,233,233,233,233,233
Red Wings,8,8,8,8,8,8,8,8,8,8,8
Rusline,18,18,18,18,18,18,18,18,18,18,18
S7 Airlines,6005,6005,6005,6005,6005,6005,6005,6005,6005,6005,6005
SCAT,1984,1984,1984,1984,1984,1984,1984,1984,1984,1984,1984
Somon Air,3913,3913,3913,3913,3913,3913,3913,3913,3913,3913,3913
Tajik Air,1705,1705,1705,1705,1705,1705,1705,1705,1705,1705,1705
Turkish Airlines,5214,5214,5214,5214,5214,5214,5214,5214,5214,5214,5214
Turkmenistan Airlines,5535,5535,5535,5535,5535,5535,5535,5535,5535,5535,5535
Ukraine International Airlines,1206,1206,1206,1206,1206,1206,1206,1206,1206,1206,1206
Ural Airlines,6210,6210,6210,6210,6210,6210,6210,6210,6210,6210,6210
Utair,2418,2418,2418,2418,2418,2418,2418,2418,2418,2418,2418
Uzbekistan Airways,14475,14475,14475,14475,14475,14475,14475,14475,14475,14475,14475
VIM Airlines,520,520,520,520,520,520,520,520,520,520,520
Wizz Air,103,103,103,103,103,103,103,103,103,103,103
Yakutia Airlines,104,104,104,104,104,104,104,104,104,104,104
Yamal Airlines,41,41,41,41,41,41,41,41,41,41,41
flydubai,2132,2132,2132,2132,2132,2132,2132,2132,2132,2132,2132

In [338]:
asia.groupby('출발 공항').count()                                # get_dtype_counts()

,노선명,항공사,출발 국가,도착 공항,도착 국가,기체번호,기종,정원(전체),년도,월,일
출발 공항,,,,,,,,,,,
AKX,492,492,492,492,492,492,492,492,492,492,492
ALA,20368,20368,20368,20368,20368,20368,20368,20368,20368,20368,20368
ASB,7920,7920,7920,7920,7920,7920,7920,7920,7920,7920,7920
AZN,341,341,341,341,341,341,341,341,341,341,341
BHK,587,587,587,587,587,587,587,587,587,587,587
CIT,858,858,858,858,858,858,858,858,858,858,858
DMB,114,114,114,114,114,114,114,114,114,114,114
DYU,8072,8072,8072,8072,8072,8072,8072,8072,8072,8072,8072
FEG,771,771,771,771,771,771,771,771,771,771,771
FRU,10758,10758,10758,10758,10758,10758,10758,10758,10758,10758,10758
GUW,1195,1195,1195,1195,1195,1195,1195,1195,1195,1195,1195
IKU,9,9,9,9,9,9,9,9,9,9,9
KGF,1004,1004,1004,1004,1004,1004,1004,1004,1004,1004,1004
KOV,23,23,23,23,23,23,23,23,23,23,23
KQT,165,165,165,165,165,165,165,165,165,165,165
KRW,23,23,23,23,23,23,23,23,23,23,23
KSN,240,240,240,240,240,240,240,240,240,240,240
KSQ,151,151,151,151,151,151,151,151,151,151,151
LBD,3782,3782,3782,3782,3782,3782,3782,3782,3782,3782,3782
NCU,95,95,95,95,95,95,95,95,95,95,95
NMA,592,592,592,592,592,592,592,592,592,592,592
NVI,185,185,185,185,185,185,185,185,185,185,185
OSS,4144,4144,4144,4144,4144,4144,4144,4144,4144,4144,4144
PLX,35,35,35,35,35,35,35,35,35,35,35
PWQ,306,306,306,306,306,306,306,306,306,306,306
SCO,1883,1883,1883,1883,1883,1883,1883,1883,1883,1883,1883
SKD,1680,1680,1680,1680,1680,1680,1680,1680,1680,1680,1680
TAS,14747,14747,14747,14747,14747,14747,14747,14747,14747,14747,14747
TJU,751,751,751,751,751,751,751,751,751,751,751
TMJ,245,245,245,245,245,245,245,245,245,245,245
TSE,12068,12068,12068,12068,12068,12068,12068,12068,12068,12068,12068
UGC,773,773,773,773,773,773,773,773,773,773,773
UKK,514,514,514,514,514,514,514,514,514,514,514
URA,121,121,121,121,121,121,121,121,121,121,121

In [339]:
asia_dep_port = asia.groupby(["항공사","출발 공항","출발 국가","도착 공항","도착 국가","년도","월"])

In [340]:
type(asia_dep_port)

pandas.core.groupby.generic.DataFrameGroupBy

In [341]:
a = asia_dep_port.agg({'월':'count',
                       '년도':'count',
                       '출발 국가':'count',
                       '도착 국가':'count',
                       '정원(전체)':'sum'})

In [342]:
a.head()

                                                           월  년도  출발 국가  \
항공사                      출발 공항 출발 국가 도착 공항 도착 국가 년도   월
AZAL Azerbaijan Airlines SCO   KAZ   GYD   AZE   2016 6    8   8      8
                                                      7    7   7      7
                                                      8   12  12     12
                                                      9    2   2      2
                                                      11   2   2      2

                                                          도착 국가  정원(전체)
항공사                      출발 공항 출발 국가 도착 공항 도착 국가 년도   월
AZAL Azerbaijan Airlines SCO   KAZ   GYD   AZE   2016 6       8     500
                                                      7       7     514
                                                      8      12     760
                                                      9       2     164
                                                      11      2     140

In [343]:
a.tail()

                                          월  년도  출발 국가  도착 국가  정원(전체)
항공사      출발 공항 출발 국가 도착 공항 도착 국가 년도   월
flydubai TSE   KAZ   DXB   UAE   2018 1  18  18     18     18    3132
                                      2  16  16     16     16    2784
                                      3  29  29     29     29    5076
                                      4  17  17     17     17    2958
                                      5  17  17     17     17    2958

In [344]:
a.index.get_level_values(0)

Index(['AZAL Azerbaijan Airlines', 'AZAL Azerbaijan Airlines',
       'AZAL Azerbaijan Airlines', 'AZAL Azerbaijan Airlines',
       'AZAL Azerbaijan Airlines', 'AZAL Azerbaijan Airlines',
       'AZAL Azerbaijan Airlines', 'AZAL Azerbaijan Airlines',
       'AZAL Azerbaijan Airlines', 'AZAL Azerbaijan Airlines',
       ...
       'flydubai', 'flydubai', 'flydubai', 'flydubai', 'flydubai', 'flydubai',
       'flydubai', 'flydubai', 'flydubai', 'flydubai'],
      dtype='object', name='항공사', length=7769)

In [345]:
a.index.get_level_values(1)

Index(['SCO', 'SCO', 'SCO', 'SCO', 'SCO', 'SCO', 'SCO', 'SCO', 'SCO', 'SCO',
       ...
       'TSE', 'TSE', 'TSE', 'TSE', 'TSE', 'TSE', 'TSE', 'TSE', 'TSE', 'TSE'],
      dtype='object', name='출발 공항', length=7769)

In [346]:
a.columns

Index(['월', '년도', '출발 국가', '도착 국가', '정원(전체)'], dtype='object')

In [347]:
a.columns = ['운항회수', '년도', '출발 국가', '도착 국가', '정원(전체)']

In [348]:
a.head()

                                                          운항회수  년도  출발 국가  \
항공사                      출발 공항 출발 국가 도착 공항 도착 국가 년도   월
AZAL Azerbaijan Airlines SCO   KAZ   GYD   AZE   2016 6      8   8      8
                                                      7      7   7      7
                                                      8     12  12     12
                                                      9      2   2      2
                                                      11     2   2      2

                                                          도착 국가  정원(전체)
항공사                      출발 공항 출발 국가 도착 공항 도착 국가 년도   월
AZAL Azerbaijan Airlines SCO   KAZ   GYD   AZE   2016 6       8     500
                                                      7       7     514
                                                      8      12     760
                                                      9       2     164
                                                      11      2     140

In [349]:
a.drop(columns="년도",axis=1,inplace=True)

In [350]:
a.head()

                                                          운항회수  출발 국가  도착 국가  \
항공사                      출발 공항 출발 국가 도착 공항 도착 국가 년도   월
AZAL Azerbaijan Airlines SCO   KAZ   GYD   AZE   2016 6      8      8      8
                                                      7      7      7      7
                                                      8     12     12     12
                                                      9      2      2      2
                                                      11     2      2      2

                                                          정원(전체)
항공사                      출발 공항 출발 국가 도착 공항 도착 국가 년도   월
AZAL Azerbaijan Airlines SCO   KAZ   GYD   AZE   2016 6      500
                                                      7      514
                                                      8      760
                                                      9      164
                                                      11     140

In [351]:
a.to_csv("example_lee.csv",encoding='cp949')

In [352]:
a.to_csv("example_lee_utf8.csv",encoding='UTF-8-SIG')